zn0321/nb_club-stm32l431/资料/3.源码/EVB_M1_Code_Demo/EVB_M1_Code_Demo/STM32L431RxTx/Src/main.c
/**
  ******************************************************************************
  * File Name          : main.c
  * Description        : Main program body
  ******************************************************************************
  ** This notice applies to any and all portions of this file
  * that are not between comment pairs USER CODE BEGIN and
  * USER CODE END. Other portions of this file, whether 
  * inserted by the user or by software development tools
  * are owned by their respective copyright owners.
  *
  * COPYRIGHT(c) 2017 STMicroelectronics
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "stm32l4xx_hal.h"
#include "i2c.h"
#include "usart.h"
#include "gpio.h"

/* USER CODE BEGIN Includes */
#include "u8g_arm.h"
#include "oled.h"
#include "bc95.h"
//#include "th_sensor.h"
#include "SHT20Drv.h"
#include "stdlib.h"
#include "stdio.h"
#include "BC95_CluB.h"

/* USER CODE END Includes */

/* Private variables ---------------------------------------------------------*/

/* USER CODE BEGIN PV */
/* Private variables ---------------------------------------------------------*/
	u8g_t u8g; 
	//extern SHT20MeasureDef SHT20Measure;
	msg_for_oled_show	msg_oled_show={0};
	msg_sys_type bc95_net_data = {0};
	int i = 0;
	uint8_t state = 0;
	uint8_t Rcv_buffer[1024] = {0};
	uint8_t Rcv_buff;
	uint8_t flag=0;
	uint8_t Send_buffer[]= "hello from \r\n";
	char *oledshow = NULL;
	enum NOW_PAGE{
		PAGE_MAIN = 0,
		PAGE_NET,
		PAGE_SHT20,
		PAGE_UDP_TEST
	};
	
	uint8_t now_page = 0;
/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);

/* USER CODE BEGIN PFP */
/* Private function prototypes -----------------------------------------------*/

/* USER CODE END PFP */

/* USER CODE BEGIN 0 */
void draw(void)
{
	//OLED_Show_Page2();
	switch(flag)
	{
		case 1:
			OLED_Show_a_Page(1);
			break;
		case 2:
			OLED_Show_a_Page(2);
			break;
		case 3:
			OLED_Show_a_Page(3);
			break;
		default:
			OLED_Show_Page1();
		  break;
	}
}
//void OLED_Show_Network_Status(void)
//{
//	printf("scq:%d\r\n",bc95_get_scq());
//	sprintf(oledshow, "SCQ:%d", bc95_get_scq());
//	u8g_DrawStr(&u8g, 25, 28, oledshow);	
//	bc95_get_time();
//}
char * double_to_string(double value)
{
	char *strings;
//	int dec,sign;
//	int ndig = 10;
//	clrscr();
//	strings = ecvt(value,ndig,&dec,&sign);
	sprintf(strings,"%lf",value);
	return strings;
}
/* USER CODE END 0 */
int main(void)
{
	/* USER CODE BEGIN 1 */
	
	/* USER CODE END 1 */

	/* MCU Configuration----------------------------------------------------------*/

	/* Reset of all peripherals, Initializes the Flash interface and the Systick. */
	HAL_Init();

	/* USER CODE BEGIN Init */

	/* USER CODE END Init */

	/* Configure the system clock */
	SystemClock_Config();

	/* USER CODE BEGIN SysInit */

	/* USER CODE END SysInit */

	/* Initialize all configured peripherals */
	MX_GPIO_Init();
	MX_I2C2_Init();
	MX_USART2_UART_Init();
	MX_USART1_UART_Init();
  SHT20Init();
	/* USER CODE BEGIN 2 */
	
	//Init
	u8g_InitComFn(&u8g, &u8g_dev_ssd1306_128x32_i2c, u8g_com_hw_i2c_fn); //here we init our u8glib driver  	
	//Open dervies
	HAL_GPIO_WritePin(GPIOB, GPIO_PIN_12, GPIO_PIN_SET);
	HAL_GPIO_WritePin(GPIOB, GPIO_PIN_12, GPIO_PIN_RESET);
	HAL_Delay(5000);
	//msg_oled_show.HUMI_for_show=0;
	
	do{
		i = CLUB_AT_QUERY(AT_COM_Test);
	}while(i != 1);
CLUB_AT_QUERY( AT_COM_NSOCL );
CLUB_AT_QUERY( AT_COM_NSOCR );
	/* USER CODE END 2 */

	/* Infinite loop */
	/* USER CODE BEGIN WHILE */
	while (1)
	{
		/* USER CODE END WHILE */

		/* USER CODE BEGIN 3 */
		
		u8g_FirstPage(&u8g);  
		do{
			draw();
		}while(u8g_NextPage(&u8g));
		//SHT20Process();
//		msg_oled_show.HUMI_for_show = "27.88";//double_to_string(SHT20Measure.HUMI);
//		msg_oled_show.TEMP_for_show = "56.78";//double_to_string(SHT20Measure.TEMP);
		
		switch(flag)
		{
			case 1:
			{
				CLUB_AT_Custom( AT_COM_Custom_CSQ );
				CLUB_AT_Custom( AT_COM_Custom_TIME );							
				break;
			}
			case 2:
			{
				SHT20Process();
				sprintf(msg_oled_show.HUMI_for_show, "%.1f", SHT20Measure.HUMI);
				sprintf(msg_oled_show.TEMP_for_show, "%.1f", SHT20Measure.TEMP);
				break;
			}
			case 3:
			{
				CLUB_AT_QUERY( AT_COM_NSOST );				
				HAL_Delay(1000);
			   CLUB_AT_Custom( AT_COM_Custom_NSORF ); 
				bc95_hexstr_to_byte(bc95_net_data.net_nsorf, bc95_net_data.net_nsorf_str, 30);
				CLUB_AT_Custom( AT_COM_Custom_TIME );
				break;
			}
			case 4:
			{
				CLUB_AT_QUERY( AT_COM_NCDP );
				CLUB_AT_QUERY( AT_COM_NMGS );							
				break;
			}
			default:
				break;
		}
		
	}
  /* USER CODE END 3 */
}

/** System Clock Configuration
*/
void SystemClock_Config(void)
{

  RCC_OscInitTypeDef RCC_OscInitStruct;
  RCC_ClkInitTypeDef RCC_ClkInitStruct;
  RCC_PeriphCLKInitTypeDef PeriphClkInit;

    /**Initializes the CPU, AHB and APB busses clocks 
    */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
  RCC_OscInitStruct.HSEState = RCC_HSE_ON;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
  RCC_OscInitStruct.PLL.PLLN = 20;
  RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV7;
  RCC_OscInitStruct.PLL.PLLQ = RCC_PLLQ_DIV2;
  RCC_OscInitStruct.PLL.PLLR = RCC_PLLR_DIV2;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

    /**Initializes the CPU, AHB and APB busses clocks 
    */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV2;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV2;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_4) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

  PeriphClkInit.PeriphClockSelection = RCC_PERIPHCLK_USART1|RCC_PERIPHCLK_USART2
                              |RCC_PERIPHCLK_I2C2;
  PeriphClkInit.Usart1ClockSelection = RCC_USART1CLKSOURCE_PCLK2;
  PeriphClkInit.Usart2ClockSelection = RCC_USART2CLKSOURCE_PCLK1;
  PeriphClkInit.I2c2ClockSelection = RCC_I2C2CLKSOURCE_PCLK1;
  if (HAL_RCCEx_PeriphCLKConfig(&PeriphClkInit) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

    /**Configure the main internal regulator output voltage 
    */
  if (HAL_PWREx_ControlVoltageScaling(PWR_REGULATOR_VOLTAGE_SCALE1) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

    /**Configure the Systick interrupt time 
    */
  HAL_SYSTICK_Config(HAL_RCC_GetHCLKFreq()/1000);

    /**Configure the Systick 
    */
  HAL_SYSTICK_CLKSourceConfig(SYSTICK_CLKSOURCE_HCLK);

  /* SysTick_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(SysTick_IRQn, 0, 0);
}

/* USER CODE BEGIN 4 */
void HAL_GPIO_EXTI_Callback(uint16_t GPIO_Pin)
{
 if(GPIO_Pin & GPIO_PIN_0){   //返回主页
	 //printf("F4\r\n");
	 flag=4;
 }
 if(GPIO_Pin & GPIO_PIN_1){    //数据发送
	 //printf("F3\r\n");
	 flag=3;
	 
 }
 if(GPIO_Pin & GPIO_PIN_2){  //温湿度
	 //printf("F2\r\n");
	 flag=2;
 }
 if(GPIO_Pin & GPIO_PIN_3){   //网络状态
	 //printf("F1\r\n");
	 flag=1;
 }
	 
}
/* USER CODE END 4 */

/**
  * @brief  This function is executed in case of error occurrence.
  * @param  None
  * @retval None
  */
void _Error_Handler(char * file, int line)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  while(1) 
  {
  }
  /* USER CODE END Error_Handler_Debug */ 
}

#ifdef USE_FULL_ASSERT

/**
   * @brief Reports the name of the source file and the source line number
   * where the assert_param error has occurred.
   * @param file: pointer to the source file name
   * @param line: assert_param error line source number
   * @retval None
   */
void assert_failed(uint8_t* file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
    ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */

}

#endif

/**
  * @}
  */ 

/**
  * @}
*/ 

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
